# Тема 3 "Словари"

person = {"name": "Егор", "age": 23, "city": "Северск"} # создание словаря
person["age"] # доступ к значению через ключ в скобках
person.get("job", "не указано") # безопасное обращение к ключу

# =============================================================================
# Изменение и добавление ключей
# =============================================================================

person["job"] = "Разработчик" # добавление нового ключа
person["age"] = 30 # изменение уже существующго значения ключа
person.update({"name": "Nick", "age": 40}) # обновляет сразу несколько значений

# =============================================================================
# Удаление ключей
# =============================================================================

del person["age"] # удаляет ключ
person.pop("job") # тоже удаляет ключ, но возвращает значение удаленного ключа

# =============================================================================
# Взаимодействие словаря с циклами
# =============================================================================

for key in person:
    print(key, person[key]) # перебирает ключи словаря

for key, value in person.items():
    print(key, value) # метод позволяет выводить одновременно и ключ. и значение

for value in person.values():
    print(value) # перебирает только значения

for key in person.keys():
    print(key) # перебирает только ключи

# =============================================================================
# Взаимодействие словаря с условиями
# =============================================================================

if "name" in person:
    print(person["name"]) # in проверяет только ключи!!!

# Всегда использовать .get(), если не уверен в существовании ключа




# Задание 1
book = {"title": "Книга 1", "author": "Иванов Иван Иванович", "year": 1998, "pages": 260}

book["genre"] = "Мистика"
book["year"] = 2000

for key, value in book.items():
    print(f"{key}: {value}")

print(book.get("rating", "Такого ключа не существует"))

print(book["rating"])




