# Задание 1
words = input("Введите слово или фразу: ")

print(words.upper())
print(words[::-1])
print(len(words.strip()))
print("а" in words.lower())











