# Тема 8 "Обработка исключений"
# Базовый синтаксис
# try:
#     result = 10 / 0
# except ZeroDivisionError:
#     print("Деление на 0 невозможно")
#
#
#
#
#
# # Несколько видов ошибок
# try:
#     number = int(input("Введите число: "))
#     result = 10 / number
#
# except ValueError:
#     print("Вы ввелим не число")
#
# except ZeroDivisionError:
#     print("На 0 делить невозможно")
#
#
#
#
#
# # else и finally
# try:
#     number = int(input("Введите число: "))
# except ValueError:
#     print("Это не число")
# else:
#     print(f"Отлично, вы ввели {number}")  # выполнится, только если ошибки НЕ было
# finally:
#     print("Попытка ввода завершена")  # выполнится ВСЕГДА, была ошибка или нет
#
#
#
#
#
# # Цикл, который переспрашивает ввод, пока не получит корректные данные
# while True:
#     try:
#         age = int(input("Введите возраст: "))
#         break
#     except ValueError:
#         print("Нужно ввести число, попробуйте снова")







# ======================================================================
# Задание 1
# try:
#     num_one = int(input("Введите первое число: "))
#     num_two = int(input("Введите второе число: "))
#
#     result = num_one / num_two
#
#     print(result)
#
# except ZeroDivisionError:
#     print("На 0 делить невозможно!")
#
# except ValueError:
#     print("Введите число!")

# ======================================================================




# ======================================================================
# Задание 2
def divide(a, b):
    try:
        return a / b

    except ZeroDivisionError:
        return "Деление на 0 невозможно!"


print(divide(10, 0))
print(divide(10, 5))

# ======================================================================




# ======================================================================
# Задание 3
while True:
    try:
        number = int(input("Введите число: "))
        break

    except ValueError:
        print("Нужно вести число!")


# ======================================================================











