# Задание 1
# Переменные каждого типа
name = "Mark"
age = 30
height = 180.4
is_alive = True

# Вывод на экран
print(name)
print(age)
print(height)
print(is_alive)

# Вывод типа переменной
print(type(name))
print(type(age))
print(type(height))
print(type(is_alive))


print(0.1 + 0.2)


# Задание 2
print(f"Меня зовут {name}. Мне {age} лет. Мой рост {height} см.")

print(10 + 5)
print(10 - 5)
print(10 * 5)
print(10 / 5)
print(10 // 5)
print(10 % 5)
print(10 ** 5)
print(10 % 3)
print(10 % 1)

print("ad" * 3)